Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# settings.mcp.agentSetup.mcpPrompt
source: # Configure Starcat MCP Server ## Goal The current AI Agent configures a user-level Starcat stdio MCP Server through Starcat CLI and completes read-only connection verification. ## MCP Parameters ```text Name: starcat Transport: stdio Command: absolute path to Starcat CLI Args: ["mcp"] ``` Resulting launch command: ```bash starcat mcp ``` ## Steps ### 1. Locate Starcat CLI macOS/Linux: ```bash command -v starcat ``` If the current shell has not refreshed PATH, check: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` If the CLI is not installed, run `%1$@` on macOS/Linux or `%2$@` in Windows PowerShell. ### 2. Check connection state ```bash starcat doctor ``` If the CLI is not paired: 1. Stop MCP configuration. 2. Report that the CLI is not paired. 3. Instruct the user to use Starcat's pairing prompt, which contains a complete `starcat pair ...` command. 4. Run `starcat doctor` again after pairing completes. ### 3. Add a user-level MCP Server Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Other MCP clients use this user-level configuration: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Choose only the configuration method for the current AI Agent. ### 4. Reload MCP configuration Reload or restart the current MCP client. If the current session cannot reload the MCP Server, report that configuration was written and the user must restart the current AI Agent. Do not claim that the connection succeeded. ### 5. Run read-only verification Verify in order: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Do not call write, delete, or summary-generation tools. ## Boundaries - Create only a user-level MCP configuration. - Do not modify project-level MCP configuration. - MCP transport must be `stdio`. - Do not put an HTTP endpoint in MCP configuration. - Do not request or configure a Local API Key. - Do not store a Bearer Token, pairing URI, or other credential. - Do not execute Starcat write tools. - Do not modify unrelated files. ## Final Report The current AI Agent reports: - Current MCP client type - Absolute Starcat CLI path - MCP configuration location - Whether restart or reload is required - Whether `initialize` succeeded - Tool count returned by `tools/list` - Whether `starcat.get_capabilities` succeeded - Incomplete steps and their reasons
ar: # إعداد خادم Starcat MCP ## الهدف يقوم وكيل الذكاء الاصطناعي الحالي بإعداد خادم Starcat MCP من نوع stdio على مستوى المستخدم عبر واجهة أوامر Starcat، ويكمل التحقق من الاتصال للقراءة فقط. ## معاملات MCP ```text الاسم: starcat النقل: stdio الأمر: المسار المطلق لواجهة أوامر Starcat الوسائط: ["mcp"] ``` أمر التشغيل الناتج: ```bash starcat mcp ``` ## الخطوات ### 1. تحديد موقع واجهة أوامر Starcat نظام macOS/Linux: ```bash command -v starcat ``` إذا لم يتم تحديث مسار PATH في الجلسة الحالية، تحقق من: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` نظام Windows PowerShell: ```powershell (Get-Command starcat).Source ``` إذا لم تكن واجهة الأوامر مثبتة، قم بتشغيل `%1$@` على macOS/Linux أو `%2$@` في Windows PowerShell. ### 2. التحقق من حالة الاتصال ```bash starcat doctor ``` إذا لم تكن واجهة الأوامر مقترنة: 1. أوقف إعداد MCP. 2. أبلغ أن واجهة الأوامر غير مقترنة. 3. اطلب من المستخدم استخدام موجه الاقتران من Starcat، والذي يحتوي على أمر `starcat pair ...` كامل. 4. شغّل `starcat doctor` مرة أخرى بعد اكتمال الاقتران. ### 3. إضافة خادم MCP على مستوى المستخدم Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` عملاء MCP الآخرون يستخدمون هذا الإعداد على مستوى المستخدم: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` اختر فقط طريقة الإعداد المناسبة لوكيل الذكاء الاصطناعي الحالي. ### 4. إعادة تحميل إعدادات MCP أعد تحميل أو أعد تشغيل عميل MCP الحالي. إذا كانت الجلسة الحالية لا تستطيع إعادة تحميل خادم MCP، أبلغ أن الإعدادات قد كُتبت ويجب على المستخدم إعادة تشغيل وكيل الذكاء الاصطناعي الحالي. لا تدّعِ أن الاتصال قد نجح. ### 5. تشغيل التحقق للقراءة فقط تحقق بالترتيب: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` لا تستدعِ أدوات الكتابة أو الحذف أو إنشاء الملخصات. ## الحدود - أنشئ إعدادات MCP على مستوى المستخدم فقط. - لا تعدّل إعدادات MCP على مستوى المشروع. - يجب أن يكون نقل MCP من نوع `stdio`. - لا تضع نقطة نهاية HTTP في إعدادات MCP. - لا تطلب أو تُعد مفتاح API محلي. - لا تخزّن رمز حامل أو رابط اقتران أو أي اعتماد آخر. - لا تنفذ أدوات الكتابة من Starcat. - لا تعدّل ملفات غير ذات صلة. ## التقرير النهائي يُبلغ وكيل الذكاء الاصطناعي الحالي: - نوع عميل MCP الحالي - المسار المطلق لواجهة أوامر Starcat - موقع إعدادات MCP - ما إذا كانت إعادة التشغيل أو إعادة التحميل مطلوبة - ما إذا نجح `initialize` - عدد الأدوات التي أرجعها `tools/list` - ما إذا نجح `starcat.get_capabilities` - الخطوات غير المكتملة وأسبابها
de: # Starcat MCP-Server konfigurieren ## Ziel Der aktuelle KI-Agent konfiguriert einen benutzerspezifischen Starcat stdio MCP-Server über die Starcat CLI und führt eine schreibgeschützte Verbindungsüberprüfung durch. ## MCP-Parameter ```text Name: starcat Transport: stdio Befehl: absoluter Pfad zur Starcat CLI Argumente: ["mcp"] ``` Resultierender Startbefehl: ```bash starcat mcp ``` ## Schritte ### 1. Starcat CLI finden macOS/Linux: ```bash command -v starcat ``` Falls die aktuelle Shell den PATH nicht aktualisiert hat, überprüfen: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` Falls die CLI nicht installiert ist, führen Sie auf macOS/Linux `%1$@` oder in Windows PowerShell `%2$@` aus. ### 2. Verbindungsstatus prüfen ```bash starcat doctor ``` Falls die CLI nicht gekoppelt ist: 1. MCP-Konfiguration stoppen. 2. Melden, dass die CLI nicht gekoppelt ist. 3. Den Benutzer anweisen, die Starcat-Kopplungsaufforderung zu verwenden, die einen vollständigen `starcat pair ...`-Befehl enthält. 4. `starcat doctor` erneut ausführen, nachdem die Kopplung abgeschlossen ist. ### 3. Benutzerspezifischen MCP-Server hinzufügen Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Andere MCP-Clients verwenden diese benutzerspezifische Konfiguration: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Wählen Sie nur die Konfigurationsmethode für den aktuellen KI-Agenten. ### 4. MCP-Konfiguration neu laden Laden Sie den aktuellen MCP-Client neu oder starten Sie ihn neu. Falls die aktuelle Sitzung den MCP-Server nicht neu laden kann, melden Sie, dass die Konfiguration geschrieben wurde und der Benutzer den aktuellen KI-Agenten neu starten muss. Behaupten Sie nicht, dass die Verbindung erfolgreich war. ### 5. Schreibgeschützte Überprüfung durchführen Überprüfen Sie in dieser Reihenfolge: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Rufen Sie keine Schreib-, Lösch- oder Zusammenfassungserstellungs-Tools auf. ## Grenzen - Nur eine benutzerspezifische MCP-Konfiguration erstellen. - Keine projektbezogene MCP-Konfiguration ändern. - MCP-Transport muss `stdio` sein. - Keinen HTTP-Endpunkt in der MCP-Konfiguration verwenden. - Keinen lokalen API-Schlüssel anfordern oder konfigurieren. - Kein Bearer-Token, keine Kopplungs-URI oder andere Anmeldeinformationen speichern. - Keine Starcat-Schreibwerkzeuge ausführen. - Keine nicht zugehörigen Dateien ändern. ## Abschlussbericht Der aktuelle KI-Agent berichtet: - Aktueller MCP-Client-Typ - Absoluter Starcat CLI-Pfad - Speicherort der MCP-Konfiguration - Ob Neustart oder Neuladen erforderlich ist - Ob `initialize` erfolgreich war - Anzahl der von `tools/list` zurückgegebenen Werkzeuge - Ob `starcat.get_capabilities` erfolgreich war - Unvollständige Schritte und deren Gründe
es: # Configurar el Servidor MCP de Starcat ## Objetivo El Agente de IA actual configura un Servidor MCP stdio de Starcat a nivel de usuario mediante la CLI de Starcat y completa la verificación de conexión de solo lectura. ## Parámetros MCP ```text Nombre: starcat Transporte: stdio Comando: ruta absoluta a la CLI de Starcat Argumentos: ["mcp"] ``` Comando de lanzamiento resultante: ```bash starcat mcp ``` ## Pasos ### 1. Localizar la CLI de Starcat macOS/Linux: ```bash command -v starcat ``` Si el shell actual no ha actualizado PATH, verifique: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` Si la CLI no está instalada, ejecute `%1$@` en macOS/Linux o `%2$@` en Windows PowerShell. ### 2. Verificar el estado de la conexión ```bash starcat doctor ``` Si la CLI no está vinculada: 1. Detenga la configuración MCP. 2. Informe que la CLI no está vinculada. 3. Indique al usuario que use el mensaje de vinculación de Starcat, que contiene un comando `starcat pair ...` completo. 4. Ejecute `starcat doctor` nuevamente después de completar la vinculación. ### 3. Agregar un Servidor MCP a nivel de usuario Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Otros clientes MCP usan esta configuración a nivel de usuario: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Elija solo el método de configuración para el Agente de IA actual. ### 4. Recargar la configuración MCP Recargue o reinicie el cliente MCP actual. Si la sesión actual no puede recargar el Servidor MCP, informe que la configuración fue escrita y que el usuario debe reiniciar el Agente de IA actual. No afirme que la conexión fue exitosa. ### 5. Ejecutar verificación de solo lectura Verifique en orden: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` No llame a herramientas de escritura, eliminación o generación de resúmenes. ## Límites - Cree solo una configuración MCP a nivel de usuario. - No modifique la configuración MCP a nivel de proyecto. - El transporte MCP debe ser `stdio`. - No coloque un punto final HTTP en la configuración MCP. - No solicite ni configure una Clave API Local. - No almacene un Token Bearer, URI de vinculación u otra credencial. - No ejecute herramientas de escritura de Starcat. - No modifique archivos no relacionados. ## Informe Final El Agente de IA actual informa: - Tipo de cliente MCP actual - Ruta absoluta de la CLI de Starcat - Ubicación de la configuración MCP - Si se requiere reinicio o recarga - Si `initialize` fue exitoso - Cantidad de herramientas devueltas por `tools/list` - Si `starcat.get_capabilities` fue exitoso - Pasos incompletos y sus razones
fr: # Configurer le serveur MCP Starcat ## Objectif L'agent IA actuel configure un serveur MCP stdio Starcat au niveau utilisateur via l'interface CLI Starcat et effectue une vérification de connexion en lecture seule. ## Paramètres MCP ```text Nom : starcat Transport : stdio Commande : chemin absolu vers l'interface CLI Starcat Arguments : ["mcp"] ``` Commande de lancement résultante : ```bash starcat mcp ``` ## Étapes ### 1. Localiser l'interface CLI Starcat macOS/Linux : ```bash command -v starcat ``` Si le shell actuel n'a pas actualisé le PATH, vérifiez : ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell : ```powershell (Get-Command starcat).Source ``` Si l'interface CLI n'est pas installée, exécutez `%1$@` sur macOS/Linux ou `%2$@` dans Windows PowerShell. ### 2. Vérifier l'état de la connexion ```bash starcat doctor ``` Si l'interface CLI n'est pas appairée : 1. Arrêtez la configuration MCP. 2. Signalez que l'interface CLI n'est pas appairée. 3. Demandez à l'utilisateur d'utiliser l'invite d'appairage Starcat, qui contient une commande `starcat pair ...` complète. 4. Exécutez à nouveau `starcat doctor` une fois l'appairage terminé. ### 3. Ajouter un serveur MCP au niveau utilisateur Codex : ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code : ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Les autres clients MCP utilisent cette configuration au niveau utilisateur : ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Choisissez uniquement la méthode de configuration pour l'agent IA actuel. ### 4. Recharger la configuration MCP Rechargez ou redémarrez le client MCP actuel. Si la session actuelle ne peut pas recharger le serveur MCP, signalez que la configuration a été écrite et que l'utilisateur doit redémarrer l'agent IA actuel. Ne prétendez pas que la connexion a réussi. ### 5. Effectuer une vérification en lecture seule Vérifiez dans l'ordre : 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` N'appelez pas d'outils d'écriture, de suppression ou de génération de résumé. ## Limites - Créez uniquement une configuration MCP au niveau utilisateur. - Ne modifiez pas la configuration MCP au niveau du projet. - Le transport MCP doit être `stdio`. - Ne mettez pas de point de terminaison HTTP dans la configuration MCP. - Ne demandez ni ne configurez de clé API locale. - Ne stockez pas de jeton Bearer, d'URI d'appairage ou autre information d'identification. - N'exécutez pas d'outils d'écriture Starcat. - Ne modifiez pas de fichiers non liés. ## Rapport final L'agent IA actuel signale : - Type de client MCP actuel - Chemin absolu de l'interface CLI Starcat - Emplacement de la configuration MCP - Si un redémarrage ou un rechargement est nécessaire - Si `initialize` a réussi - Nombre d'outils retourné par `tools/list` - Si `starcat.get_capabilities` a réussi - Étapes incomplètes et leurs raisons
id: # Konfigurasi Server MCP Starcat ## Tujuan Agen AI saat ini mengonfigurasi Server MCP Starcat stdio tingkat pengguna melalui CLI Starcat dan menyelesaikan verifikasi koneksi hanya-baca. ## Parameter MCP ```text Nama: starcat Transport: stdio Perintah: jalur absolut ke CLI Starcat Arg: ["mcp"] ``` Perintah peluncuran yang dihasilkan: ```bash starcat mcp ``` ## Langkah-langkah ### 1. Temukan CLI Starcat macOS/Linux: ```bash command -v starcat ``` Jika shell saat ini belum menyegarkan PATH, periksa: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` Jika CLI belum terinstal, jalankan `%1$@` di macOS/Linux atau `%2$@` di Windows PowerShell. ### 2. Periksa status koneksi ```bash starcat doctor ``` Jika CLI belum dipasangkan: 1. Hentikan konfigurasi MCP. 2. Laporkan bahwa CLI belum dipasangkan. 3. Instruksikan pengguna untuk menggunakan prompt pemasangan Starcat, yang berisi perintah `starcat pair ...` lengkap. 4. Jalankan `starcat doctor` lagi setelah pemasangan selesai. ### 3. Tambahkan Server MCP tingkat pengguna Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Klien MCP lain menggunakan konfigurasi tingkat pengguna ini: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Pilih hanya metode konfigurasi untuk Agen AI saat ini. ### 4. Muat ulang konfigurasi MCP Muat ulang atau mulai ulang klien MCP saat ini. Jika sesi saat ini tidak dapat memuat ulang Server MCP, laporkan bahwa konfigurasi telah ditulis dan pengguna harus memulai ulang Agen AI saat ini. Jangan klaim bahwa koneksi berhasil. ### 5. Jalankan verifikasi hanya-baca Verifikasi secara berurutan: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Jangan panggil alat tulis, hapus, atau pembuatan ringkasan. ## Batasan - Buat hanya konfigurasi MCP tingkat pengguna. - Jangan ubah konfigurasi MCP tingkat proyek. - Transport MCP harus `stdio`. - Jangan letakkan titik akhir HTTP dalam konfigurasi MCP. - Jangan minta atau konfigurasi Kunci API Lokal. - Jangan simpan Token Bearer, URI pemasangan, atau kredensial lainnya. - Jangan jalankan alat tulis Starcat. - Jangan ubah file yang tidak terkait. ## Laporan Akhir Agen AI saat ini melaporkan: - Tipe klien MCP saat ini - Jalur absolut CLI Starcat - Lokasi konfigurasi MCP - Apakah restart atau reload diperlukan - Apakah `initialize` berhasil - Jumlah alat yang dikembalikan oleh `tools/list` - Apakah `starcat.get_capabilities` berhasil - Langkah yang tidak lengkap dan alasannya
it: # Configura il server MCP di Starcat ## Obiettivo L'agente AI corrente configura un server MCP stdio a livello utente tramite la CLI di Starcat e completa la verifica della connessione in sola lettura. ## Parametri MCP ```text Nome: starcat Trasporto: stdio Comando: percorso assoluto della CLI di Starcat Argomenti: ["mcp"] ``` Comando di avvio risultante: ```bash starcat mcp ``` ## Passaggi ### 1. Individua la CLI di Starcat macOS/Linux: ```bash command -v starcat ``` Se la shell corrente non ha aggiornato PATH, controlla: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` Se la CLI non è installata, esegui `%1$@` su macOS/Linux o `%2$@` in Windows PowerShell. ### 2. Controlla lo stato della connessione ```bash starcat doctor ``` Se la CLI non è associata: 1. Interrompi la configurazione MCP. 2. Segnala che la CLI non è associata. 3. Indica all'utente di usare il prompt di associazione di Starcat, che contiene un comando `starcat pair ...` completo. 4. Esegui di nuovo `starcat doctor` dopo il completamento dell'associazione. ### 3. Aggiungi un server MCP a livello utente Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Altri client MCP usano questa configurazione a livello utente: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Scegli solo il metodo di configurazione per l'agente AI corrente. ### 4. Ricarica la configurazione MCP Ricarica o riavvia il client MCP corrente. Se la sessione corrente non può ricaricare il server MCP, segnala che la configurazione è stata scritta e l'utente deve riavviare l'agente AI corrente. Non affermare che la connessione è riuscita. ### 5. Esegui la verifica in sola lettura Verifica in ordine: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Non chiamare strumenti di scrittura, eliminazione o generazione di riepiloghi. ## Limiti - Crea solo una configurazione MCP a livello utente. - Non modificare la configurazione MCP a livello di progetto. - Il trasporto MCP deve essere `stdio`. - Non inserire un endpoint HTTP nella configurazione MCP. - Non richiedere o configurare una chiave API locale. - Non memorizzare un token Bearer, URI di associazione o altre credenziali. - Non eseguire strumenti di scrittura di Starcat. - Non modificare file non correlati. ## Report finale L'agente AI corrente segnala: - Tipo di client MCP corrente - Percorso assoluto della CLI di Starcat - Posizione della configurazione MCP - Se è necessario un riavvio o un ricaricamento - Se `initialize` è riuscito - Numero di strumenti restituiti da `tools/list` - Se `starcat.get_capabilities` è riuscito - Passaggi incompleti e relative motivazioni
ja: # Starcat MCPサーバーを設定 ## 目標 現在のAIエージェントがStarcat CLIを通じてユーザーレベルのStarcat stdio MCPサーバーを設定し、読み取り専用の接続確認を完了します。 ## MCPパラメーター ```text 名前: starcat トランスポート: stdio コマンド: Starcat CLIの絶対パス 引数: ["mcp"] ``` 結果として起動コマンド: ```bash starcat mcp ``` ## 手順 ### 1. Starcat CLIの場所を特定 macOS/Linux: ```bash command -v starcat ``` 現在のシェルでPATHが更新されていない場合は、以下を確認: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` CLIがインストールされていない場合は、macOS/Linuxでは`%1$@`を、Windows PowerShellでは`%2$@`を実行してください。 ### 2. 接続状態を確認 ```bash starcat doctor ``` CLIがペアリングされていない場合: 1. MCP設定を停止します。 2. CLIがペアリングされていないことを報告します。 3. ユーザーにStarcatのペアリングプロンプトを使用するよう指示します。これには完全な`starcat pair ...`コマンドが含まれています。 4. ペアリング完了後、再度`starcat doctor`を実行します。 ### 3. ユーザーレベルのMCPサーバーを追加 Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` 他のMCPクライアントはこのユーザーレベルの設定を使用します: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` 現在のAIエージェントに合った設定方法のみを選択してください。 ### 4. MCP設定を再読み込み 現在のMCPクライアントを再読み込みまたは再起動します。現在のセッションでMCPサーバーを再読み込みできない場合は、設定が書き込まれたことと、ユーザーが現在のAIエージェントを再起動する必要があることを報告してください。接続が成功したとは主張しないでください。 ### 5. 読み取り専用の確認を実行 以下の順序で確認: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` 書き込み、削除、または要約生成ツールを呼び出さないでください。 ## 制限 - ユーザーレベルのMCP設定のみを作成します。 - プロジェクトレベルのMCP設定は変更しないでください。 - MCPトランスポートは`stdio`である必要があります。 - MCP設定にHTTPエンドポイントを配置しないでください。 - ローカルAPIキーを要求または設定しないでください。 - Bearerトークン、ペアリングURI、その他の資格情報を保存しないでください。 - Starcatの書き込みツールを実行しないでください。 - 関連のないファイルを変更しないでください。 ## 最終報告 現在のAIエージェントは以下を報告します: - 現在のMCPクライアントタイプ - Starcat CLIの絶対パス - MCP設定の場所 - 再起動または再読み込みが必要かどうか - `initialize`が成功したかどうか - `tools/list`が返したツール数 - `starcat.get_capabilities`が成功したかどうか - 未完了の手順とその理由
ko: # Starcat MCP 서버 구성 ## 목표 현재 AI 에이전트가 Starcat CLI를 통해 사용자 수준의 Starcat stdio MCP 서버를 구성하고 읽기 전용 연결 확인을 완료합니다. ## MCP 매개변수 ```text 이름: starcat 전송: stdio 명령: Starcat CLI의 절대 경로 인수: ["mcp"] ``` 결과 실행 명령: ```bash starcat mcp ``` ## 단계 ### 1. Starcat CLI 찾기 macOS/Linux: ```bash command -v starcat ``` 현재 셸에서 PATH를 새로 고치지 않은 경우 다음을 확인하세요. ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` CLI가 설치되지 않은 경우 macOS/Linux에서는 `%1$@`을(를) 실행하고 Windows PowerShell에서는 `%2$@`을(를) 실행하세요. ### 2. 연결 상태 확인 ```bash starcat doctor ``` CLI가 페어링되지 않은 경우: 1. MCP 구성을 중지합니다. 2. CLI가 페어링되지 않았음을 보고합니다. 3. 사용자에게 완전한 `starcat pair ...` 명령이 포함된 Starcat의 페어링 프롬프트를 사용하도록 안내합니다. 4. 페어링이 완료된 후 `starcat doctor`를 다시 실행합니다. ### 3. 사용자 수준 MCP 서버 추가 Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` 다른 MCP 클라이언트는 이 사용자 수준 구성을 사용합니다. ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` 현재 AI 에이전트에 해당하는 구성 방법만 선택하세요. ### 4. MCP 구성 다시 로드 현재 MCP 클라이언트를 다시 로드하거나 다시 시작합니다. 현재 세션에서 MCP 서버를 다시 로드할 수 없는 경우 구성이 작성되었으며 사용자가 현재 AI 에이전트를 다시 시작해야 한다고 보고합니다. 연결이 성공했다고 주장하지 마십시오. ### 5. 읽기 전용 확인 실행 다음 순서로 확인합니다. 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` 쓰기, 삭제 또는 요약 생성 도구를 호출하지 마십시오. ## 경계 - 사용자 수준 MCP 구성만 생성합니다. - 프로젝트 수준 MCP 구성을 수정하지 마십시오. - MCP 전송은 `stdio`여야 합니다. - MCP 구성에 HTTP 엔드포인트를 넣지 마십시오. - 로컬 API 키를 요청하거나 구성하지 마십시오. - Bearer 토큰, 페어링 URI 또는 기타 자격 증명을 저장하지 마십시오. - Starcat 쓰기 도구를 실행하지 마십시오. - 관련 없는 파일을 수정하지 마십시오. ## 최종 보고서 현재 AI 에이전트가 보고합니다. - 현재 MCP 클라이언트 유형 - Starcat CLI 절대 경로 - MCP 구성 위치 - 다시 시작 또는 다시 로드가 필요한지 여부 - `initialize` 성공 여부 - `tools/list`가 반환한 도구 개수 - `starcat.get_capabilities` 성공 여부 - 완료되지 않은 단계와 그 이유
nl: # Starcat MCP-server configureren ## Doel De huidige AI-agent configureert een gebruikersbrede Starcat stdio MCP-server via de Starcat CLI en voltooit een alleen-lezen verbindingsverificatie. ## MCP-parameters ```text Naam: starcat Transport: stdio Opdracht: absoluut pad naar Starcat CLI Argumenten: ["mcp"] ``` Resulterende startopdracht: ```bash starcat mcp ``` ## Stappen ### 1. Zoek Starcat CLI macOS/Linux: ```bash command -v starcat ``` Als de huidige shell het PATH nog niet heeft ververst, controleer dan: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` Als de CLI niet is geïnstalleerd, voer dan `%1$@` uit op macOS/Linux of `%2$@` in Windows PowerShell. ### 2. Controleer verbindingsstatus ```bash starcat doctor ``` Als de CLI niet is gekoppeld: 1. Stop de MCP-configuratie. 2. Meld dat de CLI niet is gekoppeld. 3. Instrueer de gebruiker om de koppelingsprompt van Starcat te gebruiken, die een volledige `starcat pair ...`-opdracht bevat. 4. Voer `starcat doctor` opnieuw uit nadat het koppelen is voltooid. ### 3. Voeg een gebruikersbrede MCP-server toe Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Andere MCP-clients gebruiken deze gebruikersbrede configuratie: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Kies alleen de configuratiemethode voor de huidige AI-agent. ### 4. Herlaad MCP-configuratie Herlaad of herstart de huidige MCP-client. Als de huidige sessie de MCP-server niet kan herladen, meld dan dat de configuratie is weggeschreven en dat de gebruiker de huidige AI-agent opnieuw moet starten. Beweer niet dat de verbinding is gelukt. ### 5. Voer alleen-lezen verificatie uit Verifieer in deze volgorde: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Roep geen schrijf-, verwijder- of samenvattingsgenererende tools aan. ## Grenzen - Maak alleen een gebruikersbrede MCP-configuratie. - Wijzig geen projectbrede MCP-configuratie. - MCP-transport moet `stdio` zijn. - Plaats geen HTTP-eindpunt in de MCP-configuratie. - Vraag geen lokale API-sleutel aan of configureer deze niet. - Sla geen Bearer Token, koppelings-URI of andere inloggegevens op. - Voer geen Starcat-schrijftools uit. - Wijzig geen niet-gerelateerde bestanden. ## Eindverslag De huidige AI-agent rapporteert: - Huidig MCP-clienttype - Absoluut Starcat CLI-pad - Locatie van MCP-configuratie - Of herstart of herladen vereist is - Of `initialize` is gelukt - Aantal tools geretourneerd door `tools/list` - Of `starcat.get_capabilities` is gelukt - Onvolledige stappen en hun redenen
pl: # Konfiguracja serwera MCP Starcat ## Cel Bieżący agent AI konfiguruje na poziomie użytkownika serwer MCP Starcat przez CLI Starcat i wykonuje tylko odczyt weryfikacji połączenia. ## Parametry MCP ```text Nazwa: starcat Transport: stdio Polecenie: bezwzględna ścieżka do CLI Starcat Argumenty: ["mcp"] ``` Wynikowe polecenie uruchomienia: ```bash starcat mcp ``` ## Kroki ### 1. Znajdź CLI Starcat macOS/Linux: ```bash command -v starcat ``` Jeśli bieżąca powłoka nie odświeżyła PATH, sprawdź: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` Jeśli CLI nie jest zainstalowane, uruchom `%1$@` na macOS/Linux lub `%2$@` w Windows PowerShell. ### 2. Sprawdź stan połączenia ```bash starcat doctor ``` Jeśli CLI nie jest sparowane: 1. Zatrzymaj konfigurację MCP. 2. Zgłoś, że CLI nie jest sparowane. 3. Poinstruuj użytkownika, aby użył monitu parowania Starcat, który zawiera pełne polecenie `starcat pair ...`. 4. Po zakończeniu parowania uruchom ponownie `starcat doctor`. ### 3. Dodaj serwer MCP na poziomie użytkownika Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Inni klienci MCP używają tej konfiguracji na poziomie użytkownika: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Wybierz tylko metodę konfiguracji dla bieżącego agenta AI. ### 4. Przeładuj konfigurację MCP Przeładuj lub uruchom ponownie bieżącego klienta MCP. Jeśli bieżąca sesja nie może przeładować serwera MCP, zgłoś, że konfiguracja została zapisana i użytkownik musi uruchomić ponownie bieżącego agenta AI. Nie twierdź, że połączenie się powiodło. ### 5. Wykonaj weryfikację tylko do odczytu Zweryfikuj w kolejności: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Nie wywołuj narzędzi do zapisu, usuwania ani generowania podsumowań. ## Granice - Utwórz tylko konfigurację MCP na poziomie użytkownika. - Nie modyfikuj konfiguracji MCP na poziomie projektu. - Transport MCP musi być `stdio`. - Nie umieszczaj punktu końcowego HTTP w konfiguracji MCP. - Nie żądaj ani nie konfiguruj lokalnego klucza API. - Nie przechowuj tokena Bearer, URI parowania ani innych poświadczeń. - Nie wykonuj narzędzi do zapisu Starcat. - Nie modyfikuj niepowiązanych plików. ## Raport końcowy Bieżący agent AI raportuje: - Typ bieżącego klienta MCP - Bezwzględną ścieżkę CLI Starcat - Lokalizację konfiguracji MCP - Czy wymagane jest ponowne uruchomienie lub przeładowanie - Czy `initialize` się powiodło - Liczbę narzędzi zwróconych przez `tools/list` - Czy `starcat.get_capabilities` się powiodło - Niekompletne kroki i ich przyczyny
pt_br: # Configurar o Servidor MCP do Starcat ## Objetivo O Agente de IA atual configura um Servidor MCP stdio do Starcat em nível de usuário através da CLI do Starcat e completa a verificação de conexão somente leitura. ## Parâmetros MCP ```text Nome: starcat Transporte: stdio Comando: caminho absoluto para a CLI do Starcat Args: ["mcp"] ``` Comando de inicialização resultante: ```bash starcat mcp ``` ## Etapas ### 1. Localizar a CLI do Starcat macOS/Linux: ```bash command -v starcat ``` Se o shell atual não atualizou o PATH, verifique: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` Se a CLI não estiver instalada, execute `%1$@` no macOS/Linux ou `%2$@` no Windows PowerShell. ### 2. Verificar o estado da conexão ```bash starcat doctor ``` Se a CLI não estiver pareada: 1. Pare a configuração MCP. 2. Informe que a CLI não está pareada. 3. Instrua o usuário a usar o prompt de pareamento do Starcat, que contém um comando `starcat pair ...` completo. 4. Execute `starcat doctor` novamente após o pareamento ser concluído. ### 3. Adicionar um Servidor MCP em nível de usuário Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Outros clientes MCP usam esta configuração em nível de usuário: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Escolha apenas o método de configuração para o Agente de IA atual. ### 4. Recarregar a configuração MCP Recarregue ou reinicie o cliente MCP atual. Se a sessão atual não puder recarregar o Servidor MCP, informe que a configuração foi gravada e o usuário deve reiniciar o Agente de IA atual. Não afirme que a conexão foi bem-sucedida. ### 5. Executar verificação somente leitura Verifique na ordem: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Não chame ferramentas de gravação, exclusão ou geração de resumo. ## Limites - Crie apenas uma configuração MCP em nível de usuário. - Não modifique a configuração MCP em nível de projeto. - O transporte MCP deve ser `stdio`. - Não coloque um endpoint HTTP na configuração MCP. - Não solicite ou configure uma Chave de API Local. - Não armazene um Token Bearer, URI de pareamento ou outra credencial. - Não execute ferramentas de gravação do Starcat. - Não modifique arquivos não relacionados. ## Relatório Final O Agente de IA atual informa: - Tipo de cliente MCP atual - Caminho absoluto da CLI do Starcat - Localização da configuração MCP - Se é necessário reiniciar ou recarregar - Se `initialize` foi bem-sucedido - Número de ferramentas retornado por `tools/list` - Se `starcat.get_capabilities` foi bem-sucedido - Etapas incompletas e suas razões
ru: # Настройка MCP-сервера Starcat ## Цель Текущий AI-агент настраивает пользовательский MCP-сервер Starcat через CLI Starcat и выполняет проверку соединения только на чтение. ## Параметры MCP ```text Имя: starcat Транспорт: stdio Команда: абсолютный путь к CLI Starcat Аргументы: ["mcp"] ``` Результирующая команда запуска: ```bash starcat mcp ``` ## Шаги ### 1. Найдите CLI Starcat macOS/Linux: ```bash command -v starcat ``` Если текущая оболочка не обновила PATH, проверьте: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` Если CLI не установлен, выполните `%1$@` на macOS/Linux или `%2$@` в Windows PowerShell. ### 2. Проверьте состояние соединения ```bash starcat doctor ``` Если CLI не сопряжён: 1. Остановите настройку MCP. 2. Сообщите, что CLI не сопряжён. 3. Укажите пользователю использовать приглашение к сопряжению Starcat, которое содержит полную команду `starcat pair ...`. 4. После завершения сопряжения снова выполните `starcat doctor`. ### 3. Добавьте MCP-сервер на уровне пользователя Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Другие MCP-клиенты используют эту конфигурацию на уровне пользователя: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Выберите только метод конфигурации для текущего AI-агента. ### 4. Перезагрузите конфигурацию MCP Перезагрузите или перезапустите текущий MCP-клиент. Если текущий сеанс не может перезагрузить MCP-сервер, сообщите, что конфигурация была записана, и пользователь должен перезапустить текущего AI-агента. Не утверждайте, что соединение установлено. ### 5. Выполните проверку только на чтение Проверьте по порядку: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Не вызывайте инструменты записи, удаления или генерации сводок. ## Границы - Создавайте только конфигурацию MCP на уровне пользователя. - Не изменяйте конфигурацию MCP на уровне проекта. - Транспорт MCP должен быть `stdio`. - Не помещайте HTTP-конечную точку в конфигурацию MCP. - Не запрашивайте и не настраивайте локальный ключ API. - Не сохраняйте токен Bearer, URI сопряжения или другие учётные данные. - Не выполняйте инструменты записи Starcat. - Не изменяйте несвязанные файлы. ## Итоговый отчёт Текущий AI-агент сообщает: - Тип текущего MCP-клиента - Абсолютный путь к CLI Starcat - Расположение конфигурации MCP - Требуется ли перезапуск или перезагрузка - Успешно ли выполнено `initialize` - Количество инструментов, возвращённых `tools/list` - Успешно ли выполнено `starcat.get_capabilities` - Незавершённые шаги и их причины
tr: # Starcat MCP Sunucusunu Yapılandır ## Hedef Mevcut AI Aracısı, Starcat CLI aracılığıyla kullanıcı düzeyinde bir Starcat stdio MCP Sunucusu yapılandırır ve salt okunur bağlantı doğrulamasını tamamlar. ## MCP Parametreleri ```text Ad: starcat Taşıma: stdio Komut: Starcat CLI'nin mutlak yolu Argümanlar: ["mcp"] ``` Ortaya çıkan başlatma komutu: ```bash starcat mcp ``` ## Adımlar ### 1. Starcat CLI'yi Bulun macOS/Linux: ```bash command -v starcat ``` Geçerli kabuk PATH'i yenilemediyse, şunu kontrol edin: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` CLI yüklü değilse, macOS/Linux'ta `%1$@` veya Windows PowerShell'de `%2$@` komutunu çalıştırın. ### 2. Bağlantı durumunu kontrol edin ```bash starcat doctor ``` CLI eşleştirilmemişse: 1. MCP yapılandırmasını durdurun. 2. CLI'nin eşleştirilmediğini bildirin. 3. Kullanıcıya, tam bir `starcat pair ...` komutu içeren Starcat eşleştirme istemini kullanmasını söyleyin. 4. Eşleştirme tamamlandıktan sonra `starcat doctor` komutunu tekrar çalıştırın. ### 3. Kullanıcı düzeyinde bir MCP Sunucusu ekleyin Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Diğer MCP istemcileri bu kullanıcı düzeyindeki yapılandırmayı kullanır: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Yalnızca mevcut AI Aracısı için uygun olan yapılandırma yöntemini seçin. ### 4. MCP yapılandırmasını yeniden yükleyin Mevcut MCP istemcisini yeniden yükleyin veya yeniden başlatın. Geçerli oturum MCP Sunucusunu yeniden yükleyemiyorsa, yapılandırmanın yazıldığını ve kullanıcının mevcut AI Aracısını yeniden başlatması gerektiğini bildirin. Bağlantının başarılı olduğunu iddia etmeyin. ### 5. Salt okunur doğrulama çalıştırın Sırayla doğrulayın: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Yazma, silme veya özet oluşturma araçlarını çağırmayın. ## Sınırlar - Yalnızca kullanıcı düzeyinde bir MCP yapılandırması oluşturun. - Proje düzeyindeki MCP yapılandırmasını değiştirmeyin. - MCP taşıması `stdio` olmalıdır. - MCP yapılandırmasına bir HTTP uç noktası koymayın. - Yerel bir API Anahtarı istemeyin veya yapılandırmayın. - Bir Bearer Token, eşleştirme URI'si veya başka bir kimlik bilgisi depolamayın. - Starcat yazma araçlarını çalıştırmayın. - İlgisiz dosyaları değiştirmeyin. ## Son Rapor Mevcut AI Aracısı şunları bildirir: - Mevcut MCP istemci türü - Starcat CLI mutlak yolu - MCP yapılandırma konumu - Yeniden başlatma veya yeniden yükleme gerekip gerekmediği - `initialize` başarılı olup olmadığı - `tools/list` tarafından döndürülen araç sayısı - `starcat.get_capabilities` başarılı olup olmadığı - Tamamlanmayan adımlar ve nedenleri
uk: # Налаштування MCP-сервера Starcat ## Мета Поточний AI-агент налаштовує MCP-сервер Starcat на рівні користувача через CLI Starcat і виконує перевірку з'єднання лише для читання. ## Параметри MCP ```text Ім'я: starcat Транспорт: stdio Команда: абсолютний шлях до CLI Starcat Аргументи: ["mcp"] ``` Результуюча команда запуску: ```bash starcat mcp ``` ## Кроки ### 1. Знайдіть CLI Starcat macOS/Linux: ```bash command -v starcat ``` Якщо поточна оболонка не оновила PATH, перевірте: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` Якщо CLI не встановлено, виконайте `%1$@` на macOS/Linux або `%2$@` у Windows PowerShell. ### 2. Перевірте стан з'єднання ```bash starcat doctor ``` Якщо CLI не спарено: 1. Зупиніть налаштування MCP. 2. Повідомте, що CLI не спарено. 3. Вкажіть користувачеві використати запит на парування Starcat, який містить повну команду `starcat pair ...`. 4. Після завершення парування знову виконайте `starcat doctor`. ### 3. Додайте MCP-сервер на рівні користувача Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Інші MCP-клієнти використовують цю конфігурацію на рівні користувача: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Виберіть лише метод конфігурації для поточного AI-агента. ### 4. Перезавантажте конфігурацію MCP Перезавантажте або перезапустіть поточний MCP-клієнт. Якщо поточний сеанс не може перезавантажити MCP-сервер, повідомте, що конфігурацію записано і користувач повинен перезапустити поточного AI-агента. Не стверджуйте, що з'єднання встановлено. ### 5. Виконайте перевірку лише для читання Перевірте по порядку: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Не викликайте інструменти для запису, видалення або створення зведень. ## Межі - Створюйте лише конфігурацію MCP на рівні користувача. - Не змінюйте конфігурацію MCP на рівні проєкту. - Транспорт MCP має бути `stdio`. - Не розміщуйте HTTP-кінцеву точку в конфігурації MCP. - Не запитуйте та не налаштовуйте локальний ключ API. - Не зберігайте Bearer-токен, URI парування або інші облікові дані. - Не виконуйте інструменти запису Starcat. - Не змінюйте непов'язані файли. ## Підсумковий звіт Поточний AI-агент повідомляє: - Тип поточного MCP-клієнта - Абсолютний шлях до CLI Starcat - Розташування конфігурації MCP - Чи потрібен перезапуск або перезавантаження - Чи успішно виконано `initialize` - Кількість інструментів, повернутих `tools/list` - Чи успішно виконано `starcat.get_capabilities` - Незавершені кроки та їх причини
vi: # Cấu hình Máy chủ MCP Starcat ## Mục tiêu AI Agent hiện tại cấu hình Máy chủ MCP stdio Starcat ở cấp độ người dùng thông qua CLI Starcat và hoàn tất xác minh kết nối chỉ đọc. ## Tham số MCP ```text Tên: starcat Phương thức vận chuyển: stdio Lệnh: đường dẫn tuyệt đối đến CLI Starcat Đối số: ["mcp"] ``` Lệnh khởi chạy kết quả: ```bash starcat mcp ``` ## Các bước ### 1. Định vị CLI Starcat macOS/Linux: ```bash command -v starcat ``` Nếu shell hiện tại chưa làm mới PATH, hãy kiểm tra: ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell: ```powershell (Get-Command starcat).Source ``` Nếu CLI chưa được cài đặt, hãy chạy `%1$@` trên macOS/Linux hoặc `%2$@` trong Windows PowerShell. ### 2. Kiểm tra trạng thái kết nối ```bash starcat doctor ``` Nếu CLI chưa được ghép nối: 1. Dừng cấu hình MCP. 2. Báo cáo rằng CLI chưa được ghép nối. 3. Hướng dẫn người dùng sử dụng lời nhắc ghép nối của Starcat, chứa lệnh `starcat pair ...` hoàn chỉnh. 4. Chạy lại `starcat doctor` sau khi ghép nối hoàn tất. ### 3. Thêm Máy chủ MCP cấp người dùng Codex: ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code: ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Các máy khách MCP khác sử dụng cấu hình cấp người dùng này: ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` Chỉ chọn phương pháp cấu hình cho AI Agent hiện tại. ### 4. Tải lại cấu hình MCP Tải lại hoặc khởi động lại máy khách MCP hiện tại. Nếu phiên hiện tại không thể tải lại Máy chủ MCP, hãy báo cáo rằng cấu hình đã được ghi và người dùng phải khởi động lại AI Agent hiện tại. Không khẳng định rằng kết nối đã thành công. ### 5. Chạy xác minh chỉ đọc Xác minh theo thứ tự: 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` Không gọi các công cụ ghi, xóa hoặc tạo tóm tắt. ## Ranh giới - Chỉ tạo cấu hình MCP cấp người dùng. - Không sửa đổi cấu hình MCP cấp dự án. - Phương thức vận chuyển MCP phải là `stdio`. - Không đặt điểm cuối HTTP trong cấu hình MCP. - Không yêu cầu hoặc cấu hình Khóa API cục bộ. - Không lưu trữ Mã thông báo Bearer, URI ghép nối hoặc thông tin xác thực khác. - Không thực thi các công cụ ghi của Starcat. - Không sửa đổi các tệp không liên quan. ## Báo cáo cuối cùng AI Agent hiện tại báo cáo: - Loại máy khách MCP hiện tại - Đường dẫn tuyệt đối đến CLI Starcat - Vị trí cấu hình MCP - Có cần khởi động lại hoặc tải lại không - `initialize` có thành công không - Số lượng công cụ do `tools/list` trả về - `starcat.get_capabilities` có thành công không - Các bước chưa hoàn thành và lý do của chúng
zh_hans: # 配置 Starcat MCP Server ## 任务目标 当前 AI Agent 使用 Starcat CLI 配置用户级 stdio MCP Server，并完成只读连接验证。 ## MCP 参数 ```text Name: starcat Transport: stdio Command: Starcat CLI 的绝对路径 Args: ["mcp"] ``` 最终启动形式： ```bash starcat mcp ``` ## 执行步骤 ### 1. 查找 Starcat CLI macOS/Linux： ```bash command -v starcat ``` 如果当前 shell 尚未刷新 PATH，检查： ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell： ```powershell (Get-Command starcat).Source ``` 如果 CLI 尚未安装，macOS/Linux 运行 `%1$@`，Windows PowerShell 运行 `%2$@`。 ### 2. 检查连接状态 ```bash starcat doctor ``` 如果 CLI 尚未配对： 1. 停止 MCP 配置。 2. 报告“CLI 尚未配对”。 3. 提示用户使用 Starcat 提供的配对提示词，其中包含完整的 `starcat pair ...` 命令。 4. 配对完成后重新运行 `starcat doctor`。 ### 3. 添加用户级 MCP Server Codex： ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code： ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` 其他 MCP 客户端使用以下用户级配置： ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` 只选择与当前 AI Agent 对应的一种配置方式。 ### 4. 重新加载 MCP 配置 配置完成后，重新加载或重启当前 MCP 客户端。如果当前会话无法重新加载 MCP Server，明确报告“配置已写入，需要用户重新启动当前 AI Agent”，不得直接宣称连接成功。 ### 5. 执行只读验证 依次验证： 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` 不得调用写入、删除或摘要生成工具。 ## 操作边界 - 只创建用户级 MCP 配置。 - 不修改项目级 MCP 配置。 - MCP transport 必须是 `stdio`。 - 不在 MCP 配置中填写 HTTP endpoint。 - 不索取或配置 Local API Key。 - 不写入 Bearer Token、pairing URI 或其他凭据。 - 不执行 Starcat 写入工具。 - 不修改无关文件。 ## 完成后报告 当前 AI Agent 最终报告： - 当前 MCP 客户端类型 - Starcat CLI 绝对路径 - MCP 配置位置 - 是否需要重启或重新加载 - `initialize` 是否成功 - `tools/list` 返回的工具数量 - `starcat.get_capabilities` 是否成功 - 尚未完成的步骤及原因
zh_hant: # 配置 Starcat MCP Server ## 目標 當前 AI Agent 透過 Starcat CLI 配置使用者層級的 stdio MCP Server，並完成唯讀連線驗證。 ## MCP 參數 ```text Name: starcat Transport: stdio Command: Starcat CLI 的絕對路徑 Args: ["mcp"] ``` 最終啟動指令： ```bash starcat mcp ``` ## 步驟 ### 1. 尋找 Starcat CLI macOS/Linux： ```bash command -v starcat ``` 若目前 shell 尚未重新整理 PATH，請檢查： ```bash test -x "$HOME/.local/bin/starcat" && echo "$HOME/.local/bin/starcat" ``` Windows PowerShell： ```powershell (Get-Command starcat).Source ``` 若 CLI 尚未安裝，請在 macOS/Linux 執行 `%1$@`，或在 Windows PowerShell 執行 `%2$@`。 ### 2. 檢查連線狀態 ```bash starcat doctor ``` 若 CLI 尚未配對： 1. 停止 MCP 配置。 2. 回報 CLI 尚未配對。 3. 指示使用者使用 Starcat 的配對提示，其中包含完整的 `starcat pair ...` 指令。 4. 配對完成後再次執行 `starcat doctor`。 ### 3. 新增使用者層級 MCP Server Codex： ```bash codex mcp add starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` Claude Code： ```bash claude mcp add -s user starcat -- "<STARCAT_CLI_ABSOLUTE_PATH>" mcp ``` 其他 MCP 用戶端使用此使用者層級配置： ```json { "mcpServers": { "starcat": { "type": "stdio", "command": "<STARCAT_CLI_ABSOLUTE_PATH>", "args": ["mcp"] } } } ``` 僅選擇目前 AI Agent 適用的配置方式。 ### 4. 重新載入 MCP 配置 重新載入或重新啟動目前的 MCP 用戶端。若目前工作階段無法重新載入 MCP Server，請回報配置已寫入，使用者必須重新啟動目前的 AI Agent。請勿聲稱連線成功。 ### 5. 執行唯讀驗證 依序驗證： 1. `initialize` 2. `tools/list` 3. `starcat.get_capabilities` 請勿呼叫寫入、刪除或摘要生成工具。 ## 邊界 - 僅建立使用者層級的 MCP 配置。 - 請勿修改專案層級的 MCP 配置。 - MCP 傳輸方式必須為 `stdio`。 - 請勿在 MCP 配置中放入 HTTP 端點。 - 請勿要求或配置 Local API Key。 - 請勿儲存 Bearer Token、配對 URI 或其他憑證。 - 請勿執行 Starcat 寫入工具。 - 請勿修改不相關的檔案。 ## 最終報告 目前 AI Agent 回報： - 目前的 MCP 用戶端類型 - Starcat CLI 的絕對路徑 - MCP 配置位置 - 是否需要重新啟動或重新載入 - `initialize` 是否成功 - `tools/list` 回傳的工具數量 - `starcat.get_capabilities` 是否成功 - 未完成的步驟及其原因
